'''Задача — проверка упорядоченности последовательности.
Пользователь вводит последовательность чисел, завершающуюся нулем.
Требуется проверить, упорядочены ли они по возрастанию.
'''

x = float(input())
old_x = x - 1      # зберігажмо попередній член послідовності, менше х щоб виконалась умова і зберігся прапор в циклі
flag = True
while x != 0:
    flag = flag and x > old_x # в цьму виразві флаг стане Фолс якщо умова що введений х більше попередньо ввденого х
    old_x = x
    x = float(input())
if flag:
    print('------->')
else:
    print('<---------')
    



