'''Є строка, треба видалити всі зайві пробіли (дубляжу пробілів таби і переноси замінити
 на один пробіл, на початку і в кінці строки не повинно бути пробілів табів і переносів каретки),
  ну і після крапки, знака оклику і питання вважати що це нове речення і воно має починатися
   з великої літери.
Додатково перед знаками пунктуації крім довгого тире не повинно бути пробілів'''

import re

string = open('ex_b_in.txt')
read_string = string.read() #перевели файл в одну строку
new_string = ' '.join(read_string.split()) # спочатку методом спліт розбиваємо стороку по пробілах на список,
                                           #а потім методом джоін з списка робимо строку яка зєднає всі 
                                           #елементи списка одним пробілом

new_string = re.sub(r'\s+(?=(?:[,.?!:;…]))', r'', new_string) #регулярний вираз з бібліотеки re , в дужках 
                                                            #вказує на знаки пунктуації перед якими треба 
                                                            # прибрати пробіл
sym2 = [',', '.', '!', '?', ':', ';', '...']
for i in range(len(new_string)):
    if (new_string[i] in sym2 ) and (new_string[i+1] != ' '):
        new_string = new_string[:i+1] + ' ' + new_string[i+1:]

filter = re.compile('([!?.;]\s*)') #регулярний вираз для розділення розділових знаків
split_string = filter.split(new_string) #розділяємо текст по знаках !?.; формуємо список строк
b = list()
for part in split_string:
    b.append(part.capitalize()) # Першу літеру кожної строки робимо з великої букви
new_text = ''.join(b) # обєднуємо знову список в одну строку

new_file = open('ex_b.txt', 'w')
new_file.writelines(new_text)
string.close()
new_file.close()

